#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>


//int main()
//{
//	//float a = 6 / 5;
//	//printf("%f\n", a);//1.000000
//
//	float a = 6.0 / 5;
//	//或 a = 6/5.0
//	//或 a = 6.0/5.0
//	//或 a = 6.0f/5.0f
//	printf("%f\n", a);//1.200000
//
//	//%(取模)两个数必须为整数
//
//	return 0;
//}



//移位操作符
//int main()
//{
//	int a1 = 2;
//	//00000000000000000000000000001010
//	int a2 = 10;
//	//原码：10000000000000000000000000001010
//	//反码：11111111111111111111111111110101
//	//补码：11111111111111111111111111110110
//	int a3 = -10;
//	int b1= a1 << 1;
//	int b2= a2 >> 1;
//	int b3= a3 >> 1;
//	printf("b1 = %d\n", b1);//4
//	printf("b2 = %d\n", b2);//5
//	printf("b3 = %d\n", b3);//-5
//
//	return 0;
//}



//位操作符
//& | ^
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//& - 按（2进制）位与
//	int c1 = a & b;
//	// | - 按（2进制）位或
//	int c2 = a | b;
//	// ^ - 按（2进制）位异或
//	int c3 = a ^ b;
//	// 00000000000000000000000000000011   a
//	// 00000000000000000000000000000101   b
//	// 00000000000000000000000000000001   c1
//	// 00000000000000000000000000000111   c2
//	// 00000000000000000000000000000110   c3
//	printf("c1 = %d\n", c1);
//	printf("c2 = %d\n", c2);
//	printf("c3 = %d\n", c3);
//
//	return 0;
//}


//交换两个变量的值，不引入第三个变量
//int main()
//{
//	int a = 5;
//	int b = 3;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d   b=%d\n", a, b);
//
//	return 0;
//}



//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof (s = a + 2));
//	//sizeof括号中的表达式不参与运算
//	printf("%d\n", s);
//
//	return 0;
//}



//int main()
//{
//	int a = -1;
//	//原码   10000000000000000000000000000001
//	//反码   11111111111111111111111111111110
//	//补码   11111111111111111111111111111111
//	// ~ - 按位取反
//	//   11111111111111111111111111111111
//	//   00000000000000000000000000000000
//	int b = ~a;
//	printf("%d\n", b);
//
//	return 0;
//}



//强制类型转换
//int main()
//{
//	int a = (int)3.14;
//
//	return 0;
//}



//int main()
//{
//
//	//   && - 遇假则停
//	//  || - 遇真则停
//	int i = 0, a = 0, b = 0, c = 3, d = 4;
//	i = ++a && ++b && d++;
//	//i = a++ || ++b || ++c || d++;
//	printf("a=%d  b=%d  c=%d  d=%d\n", a, b, c, d);
//
//	return 0;
//}




int main()
{
	int a = 3;
	int b = 5;
	int c = 0;
	//逗号表达式从左到右全部计算，但整个表达式的结果是最后一个表达式的结果
	int d = (c = a + 9, b = c - 6, a += 4, c = c + 1);//7 6 13
	printf("a=%d b=%d c=%d d=%d\n", a, b, c, d);

	return 0;
}